src/AccumulationRegisters/ЗанятостьМест/ЗанятостьМест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗанятостьМест</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Территория</name>
    <type>
      <types>CatalogRef.Территории</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Площадка</name>
    <type>
      <types>CatalogRef.Площадки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ряд</name>
    <type>
      <types>CatalogRef.Ряды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Место</name>
    <type>
      <types>CatalogRef.Места</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ЗанятостьМест/ManagerModule.bsl
Функция ИнформацияОМесте(Место) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Территория");
	Результат.Вставить("Площадка");
	Результат.Вставить("Ряд");
	Результат.Вставить("Место", Место);
	Результат.Вставить("ТранспортноеСредство");
	Результат.Вставить("Состояние", Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗанятостьМест.Площадка КАК Площадка,
	|	ЗанятостьМест.Ряд КАК Ряд,
	|	ЗанятостьМест.Место КАК Место,
	|	ЗанятостьМест.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ЗанятостьМест.Состояние = 0 КАК Состояние,
	|	ЗанятостьМест.Территория КАК Территория
	|ИЗ
	|	РегистрНакопления.ЗанятостьМест КАК ЗанятостьМест
	|ГДЕ
	|	ЗанятостьМест.Место = &Место
	|	
	|	УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ
	|	");
	
	Запрос.УстановитьПараметр("Место", Место);
		Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
